cf_billing/InformationRegisters/УдалитьэнргНомераПломбСостояниеПозицийМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьэнргНомераПломбСостояниеПозицийМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/УдалитьэнргНомераПломбСостояниеПозицийМКД/Ext/ManagerModule.bsl
#Область РеализацияИнтерфейса_

Процедура ДействующиеНомераПозицииПломб(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт  
	ПредыдущееИмяТаблицы = "ОпломбированныеПриборыУчетаМКД";
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргНомераПломбНаличиеПломбМКД.ОпломбированныеПриборыУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы);		
	Иначе
		ЕстьОпломбированныеПриборыУчета		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = ПредыдущееИмяТаблицы Тогда
				ЕстьОпломбированныеПриборыУчета = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьОпломбированныеПриборыУчета Тогда
			РегистрыСведений.энргНомераПломбНаличиеПломбМКД.ОпломбированныеПриборыУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы);		
		КонецЕсли; 		 		
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеНомераПозицииПломб());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, МКД, ПриборУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеНомераПозицииПломб()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.Организация КАК Организация,
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.Район КАК Район,
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.МКД КАК МКД,
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.МестоУстановки КАК МестоУстановки
	|ИЗ
	|	РегистрСведений.УдалитьэнргНомераПломбСостояниеПозицийМКД.СрезПоследних(
	|			,
	|			(Организация, Район, МКД, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ОпломбированныеПриборыУчетаМКД.Организация,
	|					ОпломбированныеПриборыУчетаМКД.Район,
	|					ОпломбированныеПриборыУчетаМКД.МКД,
	|					ОпломбированныеПриборыУчетаМКД.ПриборУчета
	|				ИЗ
	|					ОпломбированныеПриборыУчетаМКД КАК ОпломбированныеПриборыУчетаМКД)) КАК энргНомераПломбСостояниеПозицийМКДСрезПоследних
	|ГДЕ
	|	энргНомераПломбСостояниеПозицийМКДСрезПоследних.Состояние";
	
	Возврат Текст;
КонецФункции

#КонецОбласти
